Revit 2026 API

# RebarContainerIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RebarContainerItem Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As RebarContainerItem
	Get
```
```cpp
public:
virtual property RebarContainerItem^ Current {
	RebarContainerItem^ get ();
}
```
```fsharp
abstract Current : RebarContainerItem with get
override Current : RebarContainerItem with get
```

#### Property Value

RebarContainerItem

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

RebarContainerIterator Class

Autodesk.Revit.DB.Structure Namespace